Repository: geladons/CronoForge
Catalog: chrono-forge/languages/chrono-forge-*.po
Languages: ru_ru

source: ChronoForge Diagnostics
ru_ru: Диагностика ChronoForge

source: System Status
ru_ru: Состояние системы

source: Critical issues detected that require immediate attention.
ru_ru: Обнаружены критические проблемы, требующие немедленного внимания.

source: Errors detected that should be addressed.
ru_ru: Обнаружены ошибки, которые следует устранить.

source: Minor issues detected that should be reviewed.
ru_ru: Обнаружены незначительные проблемы, которые следует проверить.

source: All systems are functioning normally.
ru_ru: Все системы функционируют нормально.

source: %d Critical
ru_ru: %d Критических

source: %d Errors
ru_ru: %d Ошибок

source: %d Warnings
ru_ru: %d Предупреждений

source: %d Total Tests
ru_ru: %d Всего тестов

source: Run Diagnostics
ru_ru: Запустить диагностику

source: Enable Safe Mode
ru_ru: Включить безопасный режим

source: Disable Safe Mode
ru_ru: Отключить безопасный режим

source: Diagnostic Tests
ru_ru: Диагностические тесты

source: PHP Syntax Check
ru_ru: Проверка синтаксиса PHP

source: File Integrity
ru_ru: Целостность файлов

source: Database Health
ru_ru: Состояние базы данных

source: WordPress Compatibility
ru_ru: Совместимость с WordPress

source: PHP Requirements
ru_ru: Требования PHP

source: File Permissions
ru_ru: Права доступа к файлам

source: Plugin Dependencies
ru_ru: Зависимости плагина

source: Configuration
ru_ru: Конфигурация

source: Details:
ru_ru: Подробности:

source: Suggestions:
ru_ru: Рекомендации:

source: All PHP files have valid syntax
ru_ru: Все PHP файлы имеют корректный синтаксис

source: Found %d syntax errors
ru_ru: Найдено %d синтаксических ошибок

source: File not found: %s
ru_ru: Файл не найден: %s

source: Syntax error in %s: %s
ru_ru: Синтаксическая ошибка в %s: %s

source: Review the syntax errors above and fix them.
ru_ru: Просмотрите синтаксические ошибки выше и исправьте их.

source: Consider restoring from a backup if available.
ru_ru: Рассмотрите возможность восстановления из резервной копии, если она доступна.

source: Contact support for assistance.
ru_ru: Обратитесь в службу поддержки за помощью.

source: All required files are present
ru_ru: Все необходимые файлы присутствуют

source: Missing files: %s
ru_ru: Отсутствующие файлы: %s

source: Corrupted files: %s
ru_ru: Поврежденные файлы: %s

source: Reinstall the plugin to restore missing/corrupted files.
ru_ru: Переустановите плагин для восстановления отсутствующих/поврежденных файлов.

source: Check file permissions on the plugin directory.
ru_ru: Проверьте права доступа к директории плагина.

source: Contact your hosting provider if the issue persists.
ru_ru: Обратитесь к вашему хостинг-провайдеру, если проблема не исчезает.

source: Database is healthy
ru_ru: База данных в порядке

source: Found %d database issues
ru_ru: Найдено %d проблем с базой данных

source: Missing table: %s
ru_ru: Отсутствующая таблица: %s

source: Table %s has no columns
ru_ru: Таблица %s не имеет столбцов

source: Database connection failed
ru_ru: Не удалось подключиться к базе данных

source: Deactivate and reactivate the plugin to recreate missing tables.
ru_ru: Деактивируйте и повторно активируйте плагин для пересоздания отсутствующих таблиц.

source: Check database permissions.
ru_ru: Проверьте права доступа к базе данных.

source: Contact your hosting provider if database issues persist.
ru_ru: Обратитесь к вашему хостинг-провайдеру, если проблемы с базой данных не исчезают.

source: WordPress compatibility check passed
ru_ru: Проверка совместимости с WordPress пройдена

source: Found %d WordPress compatibility issues
ru_ru: Найдено %d проблем совместимости с WordPress

source: WordPress version %s is below minimum required version %s
ru_ru: Версия WordPress %s ниже минимально требуемой версии %s

source: Required WordPress function missing: %s
ru_ru: Отсутствует необходимая функция WordPress: %s

source: WordPress debug mode is enabled
ru_ru: Режим отладки WordPress включен

source: Update WordPress to the latest version.
ru_ru: Обновите WordPress до последней версии.

source: Check if WordPress core files are intact.
ru_ru: Проверьте, не повреждены ли основные файлы WordPress.

source: Contact support if compatibility issues persist.
ru_ru: Обратитесь в службу поддержки, если проблемы совместимости не исчезают.

source: PHP requirements met
ru_ru: Требования PHP выполнены

source: Found %d PHP requirement issues
ru_ru: Найдено %d проблем с требованиями PHP

source: PHP version %s is below minimum required version %s
ru_ru: Версия PHP %s ниже минимально требуемой версии %s

source: Required PHP extension missing: %s
ru_ru: Отсутствует необходимое расширение PHP: %s

source: PHP memory limit %s is below recommended 128M
ru_ru: Лимит памяти PHP %s ниже рекомендуемого 128M

source: Contact your hosting provider to update PHP version and install missing extensions.
ru_ru: Обратитесь к вашему хостинг-провайдеру для обновления версии PHP и установки недостающих расширений.

source: Increase PHP memory limit to at least 128M.
ru_ru: Увеличьте лимит памяти PHP до минимум 128M.

source: File permissions are correct
ru_ru: Права доступа к файлам корректны

source: Found %d file permission issues
ru_ru: Найдено %d проблем с правами доступа к файлам

source: Plugin directory is not readable
ru_ru: Директория плагина недоступна для чтения

source: WordPress uploads directory is not writable
ru_ru: Директория загрузок WordPress недоступна для записи

source: File not readable: %s
ru_ru: Файл недоступен для чтения: %s

source: Check file and directory permissions.
ru_ru: Проверьте права доступа к файлам и директориям.

source: Contact your hosting provider to fix permission issues.
ru_ru: Обратитесь к вашему хостинг-провайдеру для исправления проблем с правами доступа.

source: All plugin dependencies are satisfied
ru_ru: Все зависимости плагина удовлетворены

source: Found %d dependency issues
ru_ru: Найдено %d проблем с зависимостями

source: Conflicting plugin detected: %s
ru_ru: Обнаружен конфликтующий плагин: %s

source: Deactivate conflicting plugins.
ru_ru: Деактивируйте конфликтующие плагины.

source: Contact support for compatibility information.
ru_ru: Обратитесь в службу поддержки за информацией о совместимости.

source: Plugin configuration is valid
ru_ru: Конфигурация плагина корректна

source: Found %d configuration issues
ru_ru: Найдено %d проблем с конфигурацией

source: Plugin activation data not found
ru_ru: Данные активации плагина не найдены

source: Safe mode is currently enabled
ru_ru: Безопасный режим в настоящее время включен

source: Error log is large (%s). Consider clearing it.
ru_ru: Журнал ошибок большой (%s). Рассмотрите возможность его очистки.

source: Review plugin settings.
ru_ru: Просмотрите настройки плагина.

source: Clear error logs if they are too large.
ru_ru: Очистите журналы ошибок, если они слишком большие.

source: Reactivate plugin if activation data is missing.
ru_ru: Повторно активируйте плагин, если данные активации отсутствуют.

source: System Information
ru_ru: Информация о системе

source: Version
ru_ru: Версия

source: Multisite
ru_ru: Мультисайт

source: Yes
ru_ru: Да

source: No
ru_ru: Нет

source: Debug Mode
ru_ru: Режим отладки

source: Enabled
ru_ru: Включен

source: Disabled
ru_ru: Отключен

source: Active Theme
ru_ru: Активная тема

source: Memory Limit
ru_ru: Лимит памяти

source: Max Execution Time
ru_ru: Максимальное время выполнения

source: Upload Max Filesize
ru_ru: Максимальный размер загружаемого файла

source: Database
ru_ru: База данных

source: MySQL Version
ru_ru: Версия MySQL

source: Plugin Version
ru_ru: Версия плагина

source: Safe Mode
ru_ru: Безопасный режим

source: Recent Error Logs
ru_ru: Последние журналы ошибок

source: Clear Error Log
ru_ru: Очистить журнал ошибок

source: Time
ru_ru: Время

source: Level
ru_ru: Уровень

source: Message
ru_ru: Сообщение

source: User
ru_ru: Пользователь

source: Unknown
ru_ru: Неизвестно

source: System
ru_ru: Система

source: Critical
ru_ru: Критический

source: Error
ru_ru: Ошибка

source: Warning
ru_ru: Предупреждение

source: Info
ru_ru: Информация

source: Debug
ru_ru: Отладка

source: No recent error logs found.
ru_ru: Последние журналы ошибок не найдены.

source: Last updated: %s
ru_ru: Последнее обновление: %s

source: Running diagnostics...
ru_ru: Выполнение диагностики...

source: Diagnostics complete
ru_ru: Диагностика завершена

source: Clearing error log...
ru_ru: Очистка журнала ошибок...

source: Error log cleared
ru_ru: Журнал ошибок очищен

source: Toggling safe mode...
ru_ru: Переключение безопасного режима...

source: Safe mode toggled
ru_ru: Безопасный режим переключен

source: Are you sure you want to clear the error log?
ru_ru: Вы уверены, что хотите очистить журнал ошибок?

source: Are you sure you want to toggle safe mode?
ru_ru: Вы уверены, что хотите переключить безопасный режим?

source: ChronoForge Critical Issues Detected
ru_ru: Обнаружены критические проблемы ChronoForge

source: Found %d critical issue that needs immediate attention.
ru_ru: Найдена %d критическая проблема, требующая немедленного внимания.

source: View Diagnostics
ru_ru: Просмотреть диагностику

source: ChronoForge Issues Detected
ru_ru: Обнаружены проблемы ChronoForge

source: Found %d error that should be addressed.
ru_ru: Найдена %d ошибка, которую следует устранить.

source: ChronoForge Safe Mode Active
ru_ru: Активен безопасный режим ChronoForge

source: The plugin is running in safe mode. Some features may be disabled.
ru_ru: Плагин работает в безопасном режиме. Некоторые функции могут быть отключены.

source: Manage Safe Mode
ru_ru: Управление безопасным режимом
